


//  إظهار رسالة ترحيبية عند فتح الموقع مباشرة

    alert("مرحباً بك في البروفايل الشخصي للمهندسة ملاك بشير اتمنى لك تجربة ممتعة في استكشاف الموقع🌷!");


//  التفاعل عند إرسال رسالة عبر نموذج التواصل
document.getElementById('contactForm').addEventListener('submit', function(event) {
    event.preventDefault(); // منع إعادة التحميل الافتراضية
    alert("تم استلام رسالتك بنجاح🌷، سيتم الرد عليها عندما تراها المهندسة ملاك.");
    this.reset(); // تفريغ حقول النموذج بعد الإرسال
});




